#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "e3d7307003c2ff32d9e1373938624458" -> "53ec74c4d37dbc16d4a09fee1a3d2648"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "b55493ad8482498cd57b63ee989e2b95" -> "1910cad83556f4d038a910198ae3bb84"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be created
  + resource "aws_s3_bucket_object" "add_tag_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "8945448ee6981e8ca87a9904d2c353a2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/add_tag_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/add_tag_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "d6c5a5c5759a845b7cedf02761249070" -> "736dc0bc86ce18b1f5aefab322c342d4"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "9a030cbc5d3187e39b003fd7f2aabaf9" -> "b2361485d0d1f2eaf8dc39774e7bf698"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "86376ed65e4772cec0ce8694af17da57" -> "34f716cbcb2541a14e27ad87c492e754"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "989d26a9c762ae67725f2da3aa5f93bb" -> "79bbad288fd3e676d8147a7379e9cb90"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "1d436d6787cde496f3aa2be6ec5cec13" -> "33c7ac892b4018bb46e93f6a849a64d7"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "6d7adfd7eb2bd3ac125b71e771c9db3c" -> "709e50aa4f30ae68ce59322312270f9e"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "97068fdd4005e4d6c95bb89c684da6fa" -> "7bcf255443f0f50bdcb422754bbb7cc4"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "3888241f70c5d2b5245bd906e0787d0f" -> "6f82685c1878d6677cc8dabdfd98675f"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be created
  + resource "aws_s3_bucket_object" "delete_tags_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "b61e9e596a78d4798a2abf4a0b055ec5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/delete_tags_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/delete_tags_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "aceebfdf40bafa8264f2e2d3f46a8575" -> "d0d5b754c79e5d8f0179f4fda13f0feb"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "b306572900d203c95b162189053d694b" -> "2c8d23050990cf8143ca9e0ecb89f6e7"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "39b748b49362e65b47f7aa3337e87f18" -> "81cd406caf2cf09c4d6baf8c72ece731"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "23ba45bb0d3cd0c14bca50cc73c9163c" -> "80447bb06d3579573ba786b22257df16"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "a0aeeb9ac89f6d4edbca3ec1061c836d" -> "ee96bce9ffd08538bd7de6e68d9dc00e"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "f0756313784d5e63215b122cdd795efa" -> "793d550388e3db58b84de8c8be697d10"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "5248eaabc37af3fd53e5b09bd7dad30b" -> "78b573fd493a52811e38606d1cf9681e"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c06cbd8bb27d928adaeb78a7542bcf0a" -> "8c6f45acc09661d97bc93bbaee463b0a"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "f7b1ba80cc170b7262829f2af8bcdafe" -> "65aaa36f036a1d503b6baaa54e1058a8"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "22da3ed5064edfbc9ef0c6b6ffaf7e74" -> "5ee50989b3f44c8a7c0830990bf30502"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "58462de39bd692ca8765ca9a129b8bd4" -> "38bce4625af32f5e631c3d970dc56a82"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "eadf60d5ee4262073c06cbdaf2ce1f42" -> "f2f00e5ad11111d1ac2c49fce64a0261"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "84d083f2b0999c391b7df628a5ec36e2" -> "b5cc3fd7b5c08a4df3642c10d0cda399"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "510fb40b6200816909009a8517b4ed85" -> "8098c1c4da0dc397509b25cdf2bdf63a"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "6ab248cf39ea7512441273b842ecaf1f" -> "ab5801436d46d1f97c7806205605067b"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "9a37ae7609fa8a805472b4f07d0fa2f1" -> "c9ccf1b02182a325ef19d94a0c3ec1ee"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "95c467d1517cf63292fa04dc773f0d8f" -> "2b27991f9c00098fa17b9b8bb8419348"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be created
  + resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "16a1ea454861e65bc1e87c31bc19a44e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_tags_by_company_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_tags_by_company_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "d1045d8f6402d750613b9704f77391df" -> "227b051b3f7c87deb4e748d862f9d40e"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "7a0f6725a3e3ced8b805266dbc1d2575" -> "46f5375c40c95372e4d3e9251d896d45"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "1e0bb79791f46adeccf05c4f65527a5e" -> "3e59dbff0bc00ecd1dbe1725feb02030"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "5814eedded9fe655b60e6d58e8c31b97" -> "32c32383991ca8405543106c43ca12aa"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "b5b3c834dec9011b5eb6018af0b1b09b" -> "ec4ad814dea2a8e09390f87a5d7268fc"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "39fd90b2905335812c3c98dffe2b870f" -> "38ff145cae974477327fc25c4be11552"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "affdd8ab0d2eb1fdb0e3e7d29fb99593" -> "54f6f6fbf06fbee23ed48b647fd73554"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "d1a147fff0e4c1127595f020c1ee6069" -> "df16a613a1554c6ce6bfd874d73e1454"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "9fb6decb622c0f56e5301c64ba56e152" -> "c228ecea55ecdab353645472cba1db5c"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "927cb2352ebd796fb597b178dc197b68" -> "a6852a70b34d808f9d7af9d8a67b52fe"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "ef816ab7733ee155c0f58f8242ba8f52" -> "fe006027eb5eec7ff344bb12196c2167"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "MSHwkZl9+MRNjpqS2Mhiexw9kt7kXEY/G39IQu1v5xo=" -> "gPR+AQdYmseNPExe1DWQ8xYr+22uNAx090MZtAZNCmA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "fsfLINYfGWfngVfi3UUKhs121EmNcD2AcFl2f3rUCyY=" -> "A9U0N8RZA0a8EFEHUhMQZ5PaToIt4sQz/nHMxIG71m0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be created
  + resource "aws_lambda_function" "add_tag_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_add_tag_lambda_function"
      + handler                        = "add_tag_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/add_tag_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "H37Md7m3jvcFwIvI40/eDjHD6PrpZ/8PRC7AJMhFQjE="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "EiJGirJmFr2+wtEcSzF6/MclnHlbnoxoFLerEp0D9V0=" -> "Ei4gJJKnDT1GRYXlJHqwvZwcdacK+FF/MaJ8jvQFFhY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "PwNIzWD8sggGLSFSyAZ767MROB1XR2YlWMCsZM65MKE=" -> "t8PrYJYW9i2lXontassJHH5pv7lVYU5UFesFX9IaTQM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "OWas56QxAggrHI0sbKJ3k1lBmQYKSh+vzHPQm4yW6Rs=" -> "N8p31tp4BlKi7wVfqSuPfcEiQ4OKvzTCpoA1a8Qv4Ac="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "KSP+RWS+UvxXzk+Fwa4zrc92EwfEa9NpNXibuaJbthk=" -> "KqFPX2XA0MhObCvqgeGkUu5Nj64P20NfagX6FBSzk8s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "3fJhm/ji9Q/VT126SEKt1I61mXxGlnn1tSOh1K1eNbw=" -> "9gospkWNiRRbr7lq5vMY/4HzfuZvbY4/HdNTXW1EhVU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "JGkxAGocywI+vPrFRppaHmxM6FDGWT1AJgd6mYVzePw=" -> "cQuSgxzSwMsQk5tSDqpEr3y5KvxY7GJp2m4+ZYHMXQk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "ovZzTt/RhHfCogIdi4SKLAX19kBpQGEAVq8/YfpHeBg=" -> "USGCUQrER21d/gLQVa9a+SwYy+OSSY/Fw2VuUKNpJTM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "ry5IZhvZQXlsJSOb+rVNPeJmfoagC68qe+iGx+h7+ck=" -> "d0LgGl9LNcwAabPRW19kTY8E/wC75oL3rhuDaWpvnSk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be created
  + resource "aws_lambda_function" "delete_tags_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_delete_tags_lambda_function"
      + handler                        = "delete_tags_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/delete_tags_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "S9NkJ+2Ye+Vk/f77C1h7HkAHaXK1l9cJoEoFLfWEgnA="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "BwEpx+NzFjQ05yRaudNnosF+Zp27iLrbUTvFNa2g2HY=" -> "/ogKwFMqf913e9j6SU3+ovWUoh9x+0DLxh8YIYdtjrA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "wb5UPoMGzbBmEtFhlVFdgtrw81ObpG+zMLW6UjLsX44=" -> "faXKZlvNj+yjzWbTIQtRBJxjJTXzYOYhdnMUy4OoRvQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "jkbjS3zP9yl8I9lVPjrKniqMXqmbmr7D7mMUr2xabKg=" -> "87NZVY3RGoZljR1WmvPE46IE/s3sbFDmbLnNFtqdpNI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "2dUxeSuC3HRd5ckJNOBJHmLxVfCuxqddavacHA/Yy08=" -> "yaiRXpVePwTou/VQXMXpd2g+3nGkzqFvrO4DEMZfNys="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-14T15:00:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "C2zF2PDX6Gdbi6GzzrpaQWq9F9rbX7FYJUxXtmcfHGs=" -> "FgsoMfTD82mW9XaCarcseGdp0JygTYcMGrMNqEPwqCU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:23.086+0000" -> (known after apply)
      ~ source_code_hash               = "st6ZxvECvQ2utv5Ym+hqZmd5ydh/HDDR+0VTS01ZzVk=" -> "VmMCRXbVPdu3mEmpvuc8MeH59WR7WKtJl7JyUXT6NzQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "agarURpwJ5k2XqADb2zGp1Svb1CUcnlXvEevh4lzq5M=" -> "/pISCQmWtlmQDjo5QTDovehELYTuUq3wQmbqZ6IkWWY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "RdhngHElLOKzpEFlx/hto/gJ/6VXhlBLrUZvBIk1qVw=" -> "bIoEztPA4Oc74hj3qRatVykS/puXADr1x39Rah0CAbQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "4W43Fu7SEZzzoH+9gGfHejos6UT69raPGBVbicN4jiI=" -> "EtUw+eJfhnjBQul37KBGysWuimTFD8Dd4AenF0dI0GM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "O2NJo2BUVBOMMcKEsYG6ylKuUsj+YWPYOff38BdEwWY=" -> "79W+ANlJwZ4VxWpW2Tfm7+A+MKNfdFdlCmye0b1gjf4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "IUR2trABaJh8lZcWQI0tMhq5P0tgt5Wni3sH8PnqwsI=" -> "oP+eMwM2FI22GB1m4OQWuiglr99guxOsUUn2u7mwGak="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "wsirE8StrIGEO00/oLiw0pHZpTew2LO4HvPOc1KzEUI=" -> "cZNmJN4iKsyraPLQ1oRIe/4I/MjRe+P/IZ2b0Rc7KlI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "2dFBbw61xP8cr55rQ1tdXgKZV1mlW+TQa08rWUHekaQ=" -> "X3Rrqc2ag3PS77X7SruKOmhyT3ISrLHq3T18Lx47dPk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "jhVmgieH63sjb0Q+eIwSozxDMZGyBWKkcpzaLVgUy2s=" -> "6XZoriCXcmfki3G4xIMeyRMSmpPRZgVMoPgR2LpFCKs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "rfSETxWmIDCxE3Sz/yT21QGPIZnlhjQXX6GI/nP1dEA=" -> "S8+xzw1vVnBz8CV71PY8dLFP9CIDVCNYi6SePM7FJJM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "QAL28N0rR8pAnoAB76hZzYjw7BhNSbW2UDRQauCQuUM=" -> "6h5NDBhrVePyCsGgmNdA1r+dKgtAMkb83aRDvmOcof8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "yL1o7Y+IUnHT8n9GHwKRJ029sG4FJuHLF8ISeXLz/lY=" -> "E9EDewQFu8kOTKzjNBBWdcSteBplGdk7GQlAGXFIxbE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be created
  + resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_tags_by_company_lambda_function"
      + handler                        = "get_tags_by_company_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_tags_by_company_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "XkNbRlmBy4kwDCMS1h5GWkpzE0Q1JsEoyhOZD0KMiLg="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "UVQUWalksA8snMWPP2FsSL79LfGNvnlRXMzK/vT7B6g=" -> "C9S2NEqRxOnQUx/1d8vOSC/ema88OBZZxZ3W2RE67Gw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "VoUwIMDWBHtANVZyFbrzuBCDBfVlWAZ1vF1CK37qsy4=" -> "tCXyhmVPHHuvShyJuZIb2OpSA/uitefgcaSbcQMRcKo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "P+keut76Dp0S5kWaW1p6Iz12hm2PLL76zhifeN31TH8=" -> "HEOh/XCUpKp/rhon9bkjNIQhsBF6MMHc+43dDIsaWtE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "QNNnoK51BPfY6JyD5N0qzcNt8I0nIi/FFBWUbtHDU9s=" -> "Wp1Vw7Xcyq394CHTbAVubqZvUhjZ6VoS8VzFC4rin2w="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "dHw5z7IDVnNO7/UyCpf0P/3j9QRvGwKznALj0kFqDBc=" -> "Ryb31w5xSX1nBlLtH5SBcNApVUAfpXvqVI8oUjbK4DM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "YNWa76kJ9nR8/gCXgIHfhyCa1erdNrfm0AgLINnRLUM=" -> "7R3batiWv/aE7h/XcKVgD/omV64heN9OtrfSR/CR44o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "QM2rVbEUuCEL+fjQGrwXHKpkLZwK78RstWlLEKrcV2k=" -> "ZBjhSfUwCS4NQY4whbQhKZEAGpR1ygf3yjGOdSRKUyI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "EJ9bT0pgeDx6T+PvjnVlrfPrdocgEZfOltgKMKENKb4=" -> "n+fyJ/5/IDe3x3VDncz5p1mm5V2h6ddCK6vK7mHvVRY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "WRDlzaQQbkncPCuEGuCZBfdI4ytbYQuXlThbYewRRHE=" -> "8Lumrob7uYfL7QdD5/DAjpIIFVVq8c6izDwY4Mw1L+0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "W8BDS1NQKBQbbQNaA90zpZc9O6HIZBA792czWdepkJE=" -> "yOYQ+5ZMDbw7sxNVg4HUpIjGQvkywheYVsvDh4+tXwg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-11T22:27:35Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "ret4qs" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-11T22:27:32Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.add_tag_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "add_tag_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_add_tag_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.delete_tags_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "delete_tags_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_delete_tags_lambda_function"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.get_tags_by_company_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_tags_by_company_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_tags_by_company_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.add_tag_integration will be created
  + resource "aws_api_gateway_integration" "add_tag_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "jp8jt7"
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_integration.delete_tags_integration will be created
  + resource "aws_api_gateway_integration" "delete_tags_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "jp8jt7"
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_integration.get_tags_by_company_integration will be created
  + resource "aws_api_gateway_integration" "get_tags_by_company_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.add_tag_method will be created
  + resource "aws_api_gateway_method" "add_tag_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "jp8jt7"
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_method.delete_tags_method will be created
  + resource "aws_api_gateway_method" "delete_tags_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "DELETE"
      + id               = (known after apply)
      + resource_id      = "jp8jt7"
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_method.get_tags_by_company_method will be created
  + resource "aws_api_gateway_method" "get_tags_by_company_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.tags_by_company will be created
  + resource "aws_api_gateway_resource" "tags_by_company" {
      + id          = (known after apply)
      + parent_id   = "hper4a"
      + path        = (known after apply)
      + path_part   = "tags"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-11T22:29:18Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.add_tag_lambda_exec_role will be created
  + resource "aws_iam_role" "add_tag_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_add_tag_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role.delete_tags_lambda_exec_role will be created
  + resource "aws_iam_role" "delete_tags_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_delete_tags_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role.get_tags_by_company_lambda_exec_role will be created
  + resource "aws_iam_role" "get_tags_by_company_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_tags_by_company_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.add_tag_cognito_policy will be created
  + resource "aws_iam_role_policy" "add_tag_cognito_policy" {
      + id     = (known after apply
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*